export interface CityGroup {
  letter: string;
  cities: string[];
}

export const RECOMMENDED_CITIES = ["无锡", "北京", "上海", "深圳", "广州", "成都", "武汉", "杭州", "天津", "西安", "南京", "重庆"];

export const CITY_GROUPS: CityGroup[] = [
  { letter: "A", cities: ["阿坝", "阿克苏", "阿拉尔", "阿拉善盟", "阿勒泰", "安康", "安庆", "鞍山", "安顺", "安阳"] },
  { letter: "B", cities: ["白城", "白山", "白银", "百色", "蚌埠", "包头", "宝鸡", "保定", "保山", "北海", "北京", "本溪", "毕节", "滨州", "亳州"] },
  { letter: "C", cities: ["沧州", "昌都", "常德", "常州", "巢湖", "朝阳", "潮州", "郴州", "成都", "承德", "池州", "赤峰", "崇左", "滁州", "重庆"] },
  { letter: "D", cities: ["达州", "大理", "大连", "大庆", "大同", "丹东", "德宏", "德阳", "德州", "迪庆", "定西", "东方", "东莞", "东营"] },
  { letter: "E", cities: ["鄂尔多斯", "鄂州", "恩施"] },
  { letter: "F", cities: ["防城港", "佛山", "福州", "抚顺", "抚州", "阜新", "阜阳"] },
  { letter: "G", cities: ["甘南", "赣州", "固原", "广安", "广元", "广州", "贵港", "贵阳", "桂林", "果洛"] },
  { letter: "H", cities: ["哈尔滨", "哈密", "海北", "海东", "海口", "海南", "海西", "邯郸", "汉中", "杭州", "合肥", "河池", "河源", "菏泽", "贺州", "鹤壁", "鹤岗", "黑河", "衡水", "衡阳", "红河", "呼和浩特", "呼伦贝尔", "湖州", "葫芦岛", "怀化", "淮安", "淮北", "淮南", "黄冈", "黄山", "黄石", "惠州"] },
  { letter: "J", cities: ["鸡西", "吉安", "吉林", "济南", "济宁", "佳木斯", "嘉兴", "嘉峪关", "江门", "焦作", "揭阳", "金昌", "金华", "锦州", "晋城", "晋中", "荆门", "荆州", "景德镇", "九江", "酒泉"] },
  { letter: "K", cities: ["开封", "喀什", "克拉玛依", "克孜勒苏", "昆明"] },
  { letter: "L", cities: ["拉萨", "来宾", "莱芜", "兰州", "廊坊", "乐山", "丽江", "丽水", "连云港", "凉山", "辽阳", "辽源", "聊城", "林芝", "临沧", "临汾", "临夏", "临沂", "柳州", "六安", "六盘水", "龙岩", "陇南", "娄底", "泸州", "吕梁", "洛阳", "漯河"] },
  { letter: "M", cities: ["马鞍山", "茂名", "眉山", "梅州", "绵阳", "牡丹江"] },
  { letter: "N", cities: ["南昌", "南充", "南京", "南宁", "南平", "南通", "南阳", "内江", "宁波", "宁德", "怒江"] },
  { letter: "P", cities: ["攀枝花", "盘锦", "平顶山", "平凉", "萍乡", "莆田", "濮阳", "普洱"] },
  { letter: "Q", cities: ["七台河", "齐齐哈尔", "黔东南", "黔南", "黔西南", "钦州", "秦皇岛", "青岛", "清远", "庆阳", "琼海", "曲靖", "衢州", "泉州"] },
  { letter: "R", cities: ["日喀则", "日照"] },
  { letter: "S", cities: ["三门峡", "三明", "三亚", "山南", "汕头", "汕尾", "商洛", "商丘", "上海", "上饶", "韶关", "邵阳", "绍兴", "深圳", "沈阳", "十堰", "石家庄", "石嘴山", "双鸭山", "朔州", "四平", "松原", "苏州", "宿迁", "宿州", "绥化", "随州", "遂宁"] },
  { letter: "T", cities: ["塔城", "台州", "太原", "泰安", "泰州", "唐山", "天津", "天水", "铁岭", "通化", "通辽", "铜川", "铜陵", "铜仁", "吐鲁番"] },
  { letter: "W", cities: ["威海", "潍坊", "渭南", "温州", "文山", "乌海", "乌兰察布", "乌鲁木齐", "无锡", "吴忠", "芜湖", "梧州", "武汉", "武威"] },
  { letter: "X", cities: ["西安", "西宁", "西双版纳", "厦门", "咸宁", "咸阳", "湘潭", "湘西", "襄阳", "孝感", "忻州", "新乡", "新余", "信阳", "兴安盟", "邢台", "徐州", "许昌", "宣城"] },
  { letter: "Y", cities: ["雅安", "烟台", "延安", "延边", "盐城", "扬州", "阳江", "阳泉", "伊春", "伊犁", "宜宾", "宜昌", "宜春", "益阳", "银川", "鹰潭", "营口", "永州", "榆林", "玉林", "玉树", "玉溪", "岳阳", "云浮", "运城"] },
  { letter: "Z", cities: ["枣庄", "湛江", "张家界", "张家口", "张掖", "漳州", "昭通", "肇庆", "镇江", "郑州", "中山", "中卫", "舟山", "周口", "珠海", "株洲", "驻马店", "资阳", "淄博", "自贡", "遵义"] },
];
